# 1303. Find the Team Size
[問題](https://leetcode.com/problems/find-the-team-size/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
team_sizeの列を追加する。

In [1]:
import pandas as pd

In [16]:
data = [[1, 8], [2, 8], [3, 8], [4, 7], [5, 9], [6, 9]]
employee = pd.DataFrame(data, columns=['employee_id', 'team_id']).astype({'employee_id':'Int64', 'team_id':'Int64'})

In [30]:
employee

   employee_id  team_id
0            1        8
1            2        8
2            3        8
3            4        7
4            5        9
5            6        9

In [36]:
def team_size(employee: pd.DataFrame) -> pd.DataFrame:
    grouped = employee.groupby("team_id").size().reset_index(name="team_size")
    result = employee.merge(grouped, on="team_id", how="inner")
    return result[["employee_id", "team_size"]]

In [37]:
team_size(employee)

   employee_id  team_size
0            1          3
1            2          3
2            3          3
3            4          1
4            5          2
5            6          2

## Test scripts

In [26]:
grouped = employee.groupby("team_id").size().reset_index(name="team_size")

In [27]:
grouped

   team_id  team_size
0        7          1
1        8          3
2        9          2

In [31]:
result = employee.merge(grouped, on="team_id", how="inner")

In [33]:
result[["employee_id", "team_size"]]

   employee_id  team_size
0            1          3
1            2          3
2            3          3
3            4          1
4            5          2
5            6          2